org/lects/announce.org
* Xmindが開けない

** USBメモリにある情報処理演習2022(.xmind)が開けない場合

自分が使っている PC に XMind アプリがインストールされていないためです。

下記サイトからWindows(64-bit)版やmacOS版，モバイル版をダウンロードし，
インストールしてください。

** ブラウザで OneDrive や GoogleDrive 上の情報処理演習2022(.xmind)が開けない場合

ブラウザの機能で，開こうとしますが，ブラウザやクラウドはXmind の機能
が，まだ，ありません。

なので，一旦，OneDrive や GoogleDrive から PC にダウンロードして，PC内のファ
イルにします。

PCに Xmind アプリがインストールされていれば，開くことができます。

* お知らせ 03 (4/25)

** zoom リモート講義を受けるために

*** 先生の配信情報
- zoom id: suzuki@iwate-u.ac.jp

- meeing info:

  URL: https://zoom.us/j/5280602571?pwd=WFNlRmYxcHVaRXV3eW10dkswVVFWdz09
  ID: 528 060 2571
  password: 0yzsb1

  上記のURLをクリックし，必要なら上のパスワードを入力して参加してくだ
  さい。


* お知らせ 02 (4/18)

** 4/18 は自宅待機の人がいるので，Zoom で講義を配信してみます。

** 教科書の配信に電子ブックリーダーの Kindle を使ってみます。

* お知らせ 01 (4/11)

** レポート課題の指示は，[[https://mellyclass.com/morioka-u/classrooms][melly]] でおこないます。[2022-04-10 日]
   
** 次回は，USBメモリを持ってきてください。[2022-04-10 日]

   - 他の講義でも指示があると思います。兼用してください。
   - できれば，USB3.0 (挿し口が青)
   - 新しく買うなら，16G以上の容量が割り安。
     アプリも入れて持ち運べます。
 
** 講義時間外の質問 [2022-04-10 日]

   僕は非常勤講師なので，大学での質問は下記時間場所でお願いします:

   - 月曜日 12:00--12:50  の講義時間
     - A306室
     - 非常勤講師控え室
     - 大学生協食堂にいます。

   時間外で質問等ある場合は，

   - msyk054@gmail.com にメールするか，
   - 水曜日の14:00~17:00に，岩大図書館の学修支援コーナーに来る

