docs/announce.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"https://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="https://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-23 月 08:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>情報処理演習2022 おしらせ</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://masayuki054.github.io/morioka_u_ict/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="https://masayuki054.github.io/morioka_u_ict/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">情報処理演習2022 おしらせ</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc6d480a">1. Xmindが開けない</a>
<ul>
<li><a href="#orgfebf5ce">1.1. USBメモリにある情報処理演習2022(.xmind)が開けない場合</a></li>
<li><a href="#orgeeeb753">1.2. ブラウザで OneDrive や GoogleDrive 上の情報処理演習2022(.xmind)が開けない場合</a></li>
</ul>
</li>
<li><a href="#org90bd762">2. お知らせ 03 (4/25)</a>
<ul>
<li><a href="#org74128aa">2.1. zoom リモート講義を受けるために</a>
<ul>
<li><a href="#orgda49b77">先生の配信情報</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1f8513c">3. お知らせ 02 (4/18)</a>
<ul>
<li><a href="#org3fbaaa8">3.1. 4/18 は自宅待機の人がいるので，Zoom で講義を配信してみます。</a></li>
<li><a href="#org425ebe0">3.2. 教科書の配信に電子ブックリーダーの Kindle を使ってみます。</a></li>
</ul>
</li>
<li><a href="#org0541161">4. お知らせ 01 (4/11)</a>
<ul>
<li><a href="#org807195f">4.1. レポート課題の指示は，melly でおこないます。<span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 日]</span></span></a></li>
<li><a href="#org306edc3">4.2. 次回は，USBメモリを持ってきてください。<span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 日]</span></span></a></li>
<li><a href="#org7163321">4.3. 講義時間外の質問 <span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 日]</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://masayuki054.hatenablog.com/entry/2022/02/16/102612">情報処理2022-トップ</a>
・<a href="https://masayuki054.github.io/morioka_u_ict/">今日の講義</a>
・<a href="https://masayuki054.github.io/morioka_u_ict/announce.html">お知らせ</a>
・<a href="https://masayuki054.github.io/morioka_u_ict/lect.html">今迄の講義内容</a>
・<a href="https://masayuki054.github.io/morioka_u_ict/reference.html">講義資料</a>
・<a href="https://drive.google.com/drive/folders/1WDaSRUc1qrxzm1lPXHoLT6OedgNa3KNs">先生のGoogleドライブ</a>
・<a href="https://moriokauniv-my.sharepoint.com/:f:/g/personal/3000261_morioka-u_ac_jp/Ek8by31oxyJOmqeEuAxRd3YBc490YpGFsBewTvZKgg6A0w">先生のOneDrive</a> (new)
・<a href="https://www.office.com/">Office365ホーム</a>
</p>


<div id="outline-container-orgc6d480a" class="outline-2">
<h2 id="orgc6d480a"><span class="section-number-2">1.</span> Xmindが開けない</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfebf5ce" class="outline-3">
<h3 id="orgfebf5ce"><span class="section-number-3">1.1.</span> USBメモリにある情報処理演習2022(.xmind)が開けない場合</h3>
<div class="outline-text-3" id="text-1-1">
<p>
自分が使っている PC に XMind アプリがインストールされていないためです。
</p>

<p>
下記サイトからWindows(64-bit)版やmacOS版，モバイル版をダウンロードし，
インストールしてください。
</p>
</div>
</div>

<div id="outline-container-orgeeeb753" class="outline-3">
<h3 id="orgeeeb753"><span class="section-number-3">1.2.</span> ブラウザで OneDrive や GoogleDrive 上の情報処理演習2022(.xmind)が開けない場合</h3>
<div class="outline-text-3" id="text-1-2">
<p>
ブラウザの機能で，開こうとしますが，ブラウザやクラウドはXmind の機能
が，まだ，ありません。
</p>

<p>
なので，一旦，OneDrive や GoogleDrive から PC にダウンロードして，PC内のファ
イルにします。
</p>

<p>
PCに Xmind アプリがインストールされていれば，開くことができます。
</p>
</div>
</div>
</div>

<div id="outline-container-org90bd762" class="outline-2">
<h2 id="org90bd762"><span class="section-number-2">2.</span> お知らせ 03 (4/25)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org74128aa" class="outline-3">
<h3 id="org74128aa"><span class="section-number-3">2.1.</span> zoom リモート講義を受けるために</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgda49b77" class="outline-4">
<h4 id="orgda49b77">先生の配信情報</h4>
<div class="outline-text-4" id="text-orgda49b77">
<ul class="org-ul">
<li>zoom id: suzuki@iwate-u.ac.jp</li>

<li><p>
meeing info:
</p>

<p>
URL: <a href="https://zoom.us/j/5280602571?pwd=WFNlRmYxcHVaRXV3eW10dkswVVFWdz09">https://zoom.us/j/5280602571?pwd=WFNlRmYxcHVaRXV3eW10dkswVVFWdz09</a>
ID: 528 060 2571
password: 0yzsb1
</p>

<p>
上記のURLをクリックし，必要なら上のパスワードを入力して参加してくだ
さい。
</p></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org1f8513c" class="outline-2">
<h2 id="org1f8513c"><span class="section-number-2">3.</span> お知らせ 02 (4/18)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3fbaaa8" class="outline-3">
<h3 id="org3fbaaa8"><span class="section-number-3">3.1.</span> 4/18 は自宅待機の人がいるので，Zoom で講義を配信してみます。</h3>
</div>

<div id="outline-container-org425ebe0" class="outline-3">
<h3 id="org425ebe0"><span class="section-number-3">3.2.</span> 教科書の配信に電子ブックリーダーの Kindle を使ってみます。</h3>
</div>
</div>

<div id="outline-container-org0541161" class="outline-2">
<h2 id="org0541161"><span class="section-number-2">4.</span> お知らせ 01 (4/11)</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org807195f" class="outline-3">
<h3 id="org807195f"><span class="section-number-3">4.1.</span> レポート課題の指示は，<a href="https://mellyclass.com/morioka-u/classrooms">melly</a> でおこないます。<span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 日]</span></span></h3>
</div>

<div id="outline-container-org306edc3" class="outline-3">
<h3 id="org306edc3"><span class="section-number-3">4.2.</span> 次回は，USBメモリを持ってきてください。<span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 日]</span></span></h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>他の講義でも指示があると思います。兼用してください。</li>
<li>できれば，USB3.0 (挿し口が青)</li>
<li>新しく買うなら，16G以上の容量が割り安。
アプリも入れて持ち運べます。</li>
</ul>
</div>
</div>

<div id="outline-container-org7163321" class="outline-3">
<h3 id="org7163321"><span class="section-number-3">4.3.</span> 講義時間外の質問 <span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 日]</span></span></h3>
<div class="outline-text-3" id="text-4-3">
<p>
僕は非常勤講師なので，大学での質問は下記時間場所でお願いします:
</p>

<ul class="org-ul">
<li>月曜日 12:00&#x2013;12:50  の講義時間
<ul class="org-ul">
<li>A306室</li>
<li>非常勤講師控え室</li>
<li>大学生協食堂にいます。</li>
</ul></li>
</ul>

<p>
時間外で質問等ある場合は，
</p>

<ul class="org-ul">
<li>msyk054@gmail.com にメールするか，</li>
<li>水曜日の14:00~17:00に，岩大図書館の学修支援コーナーに来る</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-05-23 月 08:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
